Autodesk.Revit.DB.ElementTypeGroup
The element type group.
Since:
2015

Autodesk.Revit.DB.ElementTypeGroup.EndTreatmentType
The End Treatment Type.

Autodesk.Revit.DB.ElementTypeGroup.StructuralConnectionHandlerType
The Structural Connection Handler Type.

Autodesk.Revit.DB.ElementTypeGroup.RebarContainerType
The Rebar Container Type.

Autodesk.Revit.DB.ElementTypeGroup.ColorFillType
The color fill legend type.

Autodesk.Revit.DB.ElementTypeGroup.MultiReferenceAnnotationType
The multi-reference annotation type.

Autodesk.Revit.DB.ElementTypeGroup.AnalyticalLinkType
The analytical link type.

Autodesk.Revit.DB.ElementTypeGroup.StairsType
The stairs type.

Autodesk.Revit.DB.ElementTypeGroup.DiameterDimensionType
The diameter dimension type.

Autodesk.Revit.DB.ElementTypeGroup.ConduitType
The conduilt type.

Autodesk.Revit.DB.ElementTypeGroup.CableTrayType
The cable tray type.

Autodesk.Revit.DB.ElementTypeGroup.DuctLiningType
The duct lining type.

Autodesk.Revit.DB.ElementTypeGroup.DuctInsulationType
The duct insulation type.

Autodesk.Revit.DB.ElementTypeGroup.PipeInsulationType
The pipe insulation type.

Autodesk.Revit.DB.ElementTypeGroup.WallFoundationType
The wall foundation type.

Autodesk.Revit.DB.ElementTypeGroup.SpotSlopeType
The spot slope type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeGraphScheduleColumn
The graph schedule column view type.

Autodesk.Revit.DB.ElementTypeGroup.SpotCoordinateType
The spot coordinate type.

Autodesk.Revit.DB.ElementTypeGroup.WireType
The wire type.

Autodesk.Revit.DB.ElementTypeGroup.FlexPipeType
The flex pipe type.

Autodesk.Revit.DB.ElementTypeGroup.PipeType
The pipe type.

Autodesk.Revit.DB.ElementTypeGroup.FlexDuctType
The flex duct type.

Autodesk.Revit.DB.ElementTypeGroup.DuctType
The duct type.

Autodesk.Revit.DB.ElementTypeGroup.FabricSheetType
The fabric sheet type.

Autodesk.Revit.DB.ElementTypeGroup.FabricAreaType
The fabric area type.

Autodesk.Revit.DB.ElementTypeGroup.PathReinforcementType
Path reinforcement type.

Autodesk.Revit.DB.ElementTypeGroup.AreaReinforcementType
Area reinforcement type.

Autodesk.Revit.DB.ElementTypeGroup.RebarBarType
The rebar bar type.

Autodesk.Revit.DB.ElementTypeGroup.PointLoadType
The point load type.

Autodesk.Revit.DB.ElementTypeGroup.LineLoadType
The line load type.

Autodesk.Revit.DB.ElementTypeGroup.AreaLoadType
The area load type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypePanelSchedule
The panel schedule view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypePressureLossReport
The pressure loss report view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeLoadsReport
The loads report view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeStructuralElevation
The structrual elevation view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeElevation
The elevation view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeDetailView
The detail view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeSection
The section view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeCeilingPlan
The ceiling plan view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeFloorPlan
The floor plan view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeStructuralPlan
The structural plan view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeDrafting
The drafting view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeSheet
The sheet view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeCostReport
The cost report view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeLegend
The legend view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeSchedule
The schedule view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeRendering
The rendering view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeWalkthrough
The walkthrough view type.

Autodesk.Revit.DB.ElementTypeGroup.ViewType3D
The 3D view type.

Autodesk.Revit.DB.ElementTypeGroup.CurtainSystemType
The curtain system type.

Autodesk.Revit.DB.ElementTypeGroup.BeamSystemType
The beam system type.

Autodesk.Revit.DB.ElementTypeGroup.RepeatingDetailType
The repeating detail type.

Autodesk.Revit.DB.ElementTypeGroup.EdgeSlabType
The slab edge type.

Autodesk.Revit.DB.ElementTypeGroup.GutterType
The gutter type.

Autodesk.Revit.DB.ElementTypeGroup.FasciaType
The fascial type.

Autodesk.Revit.DB.ElementTypeGroup.RoofSoffitType
The roof soffit type.

Autodesk.Revit.DB.ElementTypeGroup.ContourLabelingType
The contour labeling type.

Autodesk.Revit.DB.ElementTypeGroup.DecalType
The decal type.

Autodesk.Revit.DB.ElementTypeGroup.BuildingPadType
The building pad type.

Autodesk.Revit.DB.ElementTypeGroup.ArcLengthDimensionType
The arc length dimension type.

Autodesk.Revit.DB.ElementTypeGroup.AngularDimensionType
The angular dimension type.

Autodesk.Revit.DB.ElementTypeGroup.RadialDimensionType
The radial dimension type.

Autodesk.Revit.DB.ElementTypeGroup.FilledRegionType
The filled region type.

Autodesk.Revit.DB.ElementTypeGroup.AttachedDetailGroupType
The attached detail group type.

Autodesk.Revit.DB.ElementTypeGroup.DetailGroupType
The detail group type.

Autodesk.Revit.DB.ElementTypeGroup.ModelGroupType
The model group type.

Autodesk.Revit.DB.ElementTypeGroup.StairsRailingType
The stairs railing type.

Autodesk.Revit.DB.ElementTypeGroup.RampType
The ramp type.

Autodesk.Revit.DB.ElementTypeGroup.CalloutType
The callout view type.

Autodesk.Revit.DB.ElementTypeGroup.ReferenceViewerType
The reference viewer type.

Autodesk.Revit.DB.ElementTypeGroup.ViewportType
The viewport type.

Autodesk.Revit.DB.ElementTypeGroup.RevealType
The reveal type.

Autodesk.Revit.DB.ElementTypeGroup.CorniceType
The cornice type.

Autodesk.Revit.DB.ElementTypeGroup.ModelTextType
The model text type.

Autodesk.Revit.DB.ElementTypeGroup.TagNoteType
The tag note type.

Autodesk.Revit.DB.ElementTypeGroup.TextNoteType
The text note type.

Autodesk.Revit.DB.ElementTypeGroup.SpotElevationType
The spot elevation type.

Autodesk.Revit.DB.ElementTypeGroup.LinearDimensionType
The linear dimension type.

Autodesk.Revit.DB.ElementTypeGroup.LevelType
The Level Type

Autodesk.Revit.DB.ElementTypeGroup.GridType
The Grid Type.

Autodesk.Revit.DB.ElementTypeGroup.StairsBySketchType
The stairs by sketch type.

Autodesk.Revit.DB.ElementTypeGroup.CeilingType
The ceiling type.

Autodesk.Revit.DB.ElementTypeGroup.FootingSlabType
The footing slab type.

Autodesk.Revit.DB.ElementTypeGroup.FloorType
The floor type.

Autodesk.Revit.DB.ElementTypeGroup.RoofType
The roof type.

Autodesk.Revit.DB.ElementTypeGroup.WallType
The wall type.

Autodesk.Revit.DB.ElementTypeGroup.RailingsTypeForRamps
The railings type for ramps.

Autodesk.Revit.DB.ElementTypeGroup.RailingsTypeForStairs
The railings type for stairs.